"""
Задача:
Ви керуєте невеликим кіоском з виробництва вафель і хочете максимізувати свій щоденний прибуток. 
Ви виготовляєте два види вафель: класичні вафлі (x) та шоколадні вафлі (y). Ви отримуєте прибуток у розмірі 3 долари за кожну класичну вафлю та 4 долари за кожну шоколадну вафлю.
Вам потрібно виготовити щонайменше 5 вафель кожного виду, щоб задовольнити попит і уникнути дефіциту.
На виготовлення класичної вафлі потрібно 10 хвилин (1/6 години), а на виготовлення шоколадної вафлі — 15 хвилин (1/4 години), і у вас є лише 8 годин на день.
У вас є лише 6 кг борошна на день, а для виготовлення однієї класичної вафлі потрібно 250 г борошна, а для виготовлення однієї шоколадної вафлі — 300 г борошна.
Також у вас є лише 20 яєць щодня, а для виготовлення будь-якого виду вафлі потрібно одне яйце.

Z =  3x + 4y -> max
Z =  -3x - 4y -> min (use linprog)

x >= 5
y >= 5

(⅙)x + (¼)y <= 8
0.25x + 0.3 <= 6
x + y <= 20
"""

from scipy.optimize import linprog

profit_func_coefficients = [-3, -4]

A_ub = [
    [1/6, 1/4],
    [0.25, 0.3], 
    [1, 1]
]

b_ub = [8, 6, 20]

x_bounds = (5, None)
y_bounds = (5, None)

# Solve the linear programming problem
result = linprog(profit_func_coefficients, A_ub=A_ub, b_ub=b_ub, bounds=[x_bounds, y_bounds], method='highs')

print(-result.fun)
print(f"X = {result.x[0]}")
print(f"Y = {result.x[1]}")
